"""Напишите программу, которая считывает строку-разделитель и три строки, 
а затем выводит указанные строки через разделитель."""
separator = input()
s1 = input()
s2 = input()
s3 = input()
print(s1, s2, s3, sep = separator)