"""Расстояние в метрах
Напишите программу, которая находит полное число метров по заданному числу сантиметров."""
a = int(input())
b = a // 100
print(b)
