"""Размножение n-ок
Напишите программу, которая считывает целое положительное число n и выводит значение числа n + nn + nnn"""
a = int(input())
b = a * 11
c = a * 111
e = a + b + c
print(e)