"""Сумма трёх чисел
Напишите программу, которая считывает три целых числа и выводит на экран их сумму. 
Каждое число записано в отдельной строке."""
#Решение 1
a = int(input())
b = int(input())
c = int(input())
print(a + b + c)
#Решение 2
a = int(input())
b = int(input())
c = int(input())
d = a + b + c
print(d)