"""Сумма квадратов VS квадрат суммы
Напишите программу, которая считывает два целых числа a и b и выводит на экран квадрат суммы (a+b)**2 
и сумму квадратов a**2+b**2этих чисел."""
a = int(input())
b = int(input())
print("Квадрат суммы", a, "и", b, "равен",(a + b) ** 2)
print("Сумма квадратов", a, "и", b, "равна", (a ** 2) + (b ** 2))