"""Стоимость покупки
Напишите программу, которая считает стоимость трех компьютеров, состоящих из монитора, 
системного блока, клавиатуры и мыши."""
#Решение 1
a = int(input())
b = int(input())
c = int(input())
d = int(input())
print((a + b + c + d) * 3)
#Решение 2
a = int(input())
b = int(input())
c = int(input())
d = int(input())
e = a + b + c + d
print(e * 3)
#Решение 3
a = int(input())
b = int(input())
c = int(input())
d = int(input())
e = (a + b + c + d) * 3
print(e)