"""Большое число
Как известно, целые числа в языке Python не имеют ограничений, которые встречаются в других языках программирования. 
Напишите программу, которая считывает четыре целых положительных числа a, \, b, \, ca,b,c и dd и выводит на экран значение выражения a**b + c**d"""
a = int(input())
b = int(input())
c = int(input())
d = int(input())
print(a**b + c**d)
